const express = require("express");
const app = express();
const cors = require("cors");
const port = process.env.PORT || 9001;

const recipes = [
  {
    
      id: 1,
      title: "بيتزا",
      ingredients: [
        "1 1/2 كوب دقيق",
        "1 كوب ماء دافئ",
        "2 ملعقة كبيرة زيت زيتون",
        "1 ملعقة كبيرة خميرة فورية",
        "1 ملعقة صغيرة سكر",
        "1/2 ملعقة صغيرة ملح",
        "1/2 كوب صلصة طماطم",
        "1 كوب جبن موزاريلا مبشور",
        "توبينغز (خضروات، لحوم، زيتون، حسب الرغبة)",
      ],
      instructions:
        "1. في وعاء كبير، اخلط الماء الدافئ مع السكر والخميرة، واتركه لمدة 10 دقائق حتى يتفاعل. \n2. أضف الزيت، الملح، والدقيق تدريجياً، واعجن حتى تحصل على عجينة ناعمة. \n3. ضع العجينة في وعاء مدهون بالزيت، غطها واتركها في مكان دافئ لمدة ساعة حتى يتضاعف حجمها. \n4. قم بفرد العجينة على سطح مرشوش بالدقيق، وضعها في صينية خبز. \n5. ادهن الصلصة على العجينة، ثم ضع الجبن والتوبينغز حسب الرغبة. \n6. اخبز في فرن محمى مسبقاً على 220 درجة مئوية لمدة 15-20 دقيقة حتى تصبح العجينة ذهبية والجبن ذائب.",
      
      category: "mainFood",
    },
    {
    id: 2,
    title: "كبسة",
    ingredients: [
      "2 كوب أرز بسمتي",
      "1 دجاجة مقطعة إلى أجزاء",
      "3 ملعقة كبيرة زيت نباتي",
      "1 بصلة كبيرة مفرومة",
      "4 فصوص ثوم مفروم",
      "2 حبة طماطم مفرومة",
      "1 ملعقة كبيرة معجون طماطم",
      "1 ملعقة صغيرة كركم",
      "1 ملعقة صغيرة كمون",
      "1 ملعقة صغيرة بهارات الكبسة",
      "1 ملعقة صغيرة قرفة",
      "1 ملعقة صغيرة فلفل أسود",
      "1 ملعقة صغيرة ملح",
      "2 ورقة غار",
      "3 حبات هيل",
      "4 حبات قرنفل",
      "1 عود قرفة",
      "4 كوب ماء",
      "1/2 كوب زبيب",
      "1/2 كوب لوز محمص",
      "1/2 كوب جزر مبشور (اختياري)",
    ],
    instructions:
      "1. في قدر كبير، سخن الزيت على نار متوسطة. أضف البصل المفروم وقلّب حتى يصبح شفافاً. أضف الثوم وقلّب لعدة ثوانٍ. أضف قطع الدجاج وقلّب حتى تتحمر من جميع الجهات. أضف الطماطم المفرومة ومعجون الطماطم واستمر في التقليب حتى تتبخر السوائل. \n2. أضف الكركم، الكمون، بهارات الكبسة، القرفة، الفلفل الأسود، والملح. اخلط جيداً حتى تتوزع التوابل على الدجاج. \n3. أضف الماء إلى القدر، ثم أضف ورق الغار، الهيل، القرنفل، وعود القرفة. اترك الخليط يغلي، ثم خفف الحرارة وغطّ القدر، واتركه ينضج حتى ينضج الدجاج تماماً (حوالي 30-40 دقيقة). \n4. اغسل الأرز جيداً وانقعه في الماء لمدة 30 دقيقة، ثم صفيه. أضف الأرز إلى قدر الدجاج، وتأكد من أن الماء يغمر الأرز. قم بتغطيته واتركه على نار هادئة حتى ينضج الأرز تماماً (حوالي 20-25 دقيقة). \n5. في مقلاة صغيرة، قم بتحميص الزبيب واللوز في قليل من الزيت حتى يصبح لونها ذهبياً. أضف الزبيب واللوز إلى الكبسة في النهاية وقلّب بلطف.",
   
    category: "mainFood",
  },
  {
    id: 3,
    title: "سمك مشوي",
    ingredients: [
      "1 كيلو سمك كامل (مثل البلطي أو الباسا)",
      "2 ملعقة كبيرة زيت زيتون",
      "1 ملعقة صغيرة فلفل أسود",
      "1 ملعقة صغيرة ملح",
      "1 ملعقة صغيرة بابريكا",
      "2 فصوص ثوم مفروم",
      "عصير ليمونة واحدة",
      "1 ملعقة صغيرة زعتر",
    ],
    instructions:
      "1. سخن الفرن إلى 200 درجة مئوية. \n2. اخلط زيت الزيتون، الفلفل الأسود، الملح، البابريكا، الثوم، عصير الليمون، والزعتر في وعاء صغير. \n3. افرك السمك بالخليط وضعه في صينية خبز. \n4. اشوي السمك في الفرن لمدة 20-25 دقيقة حتى ينضج.",
   
    category: "mainFood",
  },

  {
    id: 4,
    title: "شاورما",
    ingredients: [
      "1 كيلو صدور دجاج مقطعة شرائح",
      "1 كوب لبن زبادي",
      "2 ملعقة كبيرة معجون طماطم",
      "1 ملعقة كبيرة زيت زيتون",
      "1 ملعقة صغيرة ملح",
      "1 ملعقة صغيرة فلفل أسود",
      "1 ملعقة صغيرة كركم",
      "1 ملعقة صغيرة كمون",
      "1 ملعقة صغيرة بهارات شاورما",
      "4 فصوص ثوم مفروم",
      "1 حبة ليمون (عصير)",
      "4 أرغفة خبز عربي",
      "خضروات مفرومة (طماطم، خيار، بصل، خس)",
    ],
    instructions:
      "1. في وعاء كبير، اخلط اللبن الزبادي، معجون الطماطم، زيت الزيتون، الملح، الفلفل الأسود، الكركم، الكمون، بهارات الشاورما، الثوم، وعصير الليمون. \n2. أضف شرائح الدجاج إلى التتبيلة، واتركها في الثلاجة لمدة 2 ساعة على الأقل (من الأفضل طوال الليل). \n3. سخن مقلاة على نار متوسطة، ثم أضف الدجاج المتبل وقلّب حتى يتحمر وينضج تماماً. \n4. قطع الدجاج إلى شرائح رفيعة وقدمه داخل الخبز العربي مع الخضروات المفرومة.",
    
    category: "mainFood",
  },

 
  {
    id: 5,
    title: "برجر",
    ingredients: [
      "500 جرام لحم بقر مفروم",
      "1 بصلة مفرومة ناعماً",
      "2 فصوص ثوم مفروم",
      "1 ملعقة صغيرة ملح",
      "1 ملعقة صغيرة فلفل أسود",
      "1 ملعقة صغيرة بابريكا",
      "1 ملعقة صغيرة بهارات بورجر",
      "4 أرغفة خبز بورجر",
      "خضروات للتقديم (خس، طماطم، بصل، مخلل)",
      "صلصة (مايونيز، كاتشب، خردل)",
    ],
    instructions:
      "1. في وعاء كبير، اخلط اللحم المفروم مع البصل، الثوم، الملح، الفلفل، البابريكا، وبهارات البورجر. \n2. قسم المزيج إلى كرات صغيرة، ثم شكلها إلى أقراص بورجر. \n3. سخن مقلاة على نار متوسطة، ثم اشوي أقراص البورجر حتى تنضج تماماً. \n4. قدم أقراص البورجر داخل الخبز مع الخضروات والصلصات حسب الرغبة.",
   
    category: "mainFood",
  },
  {
    id: 6,
    title: "سوشي",
    ingredients: [
      "2 كوب أرز سوشي",
      "2 1/2 كوب ماء",
      "1/2 كوب خل الأرز",
      "1/4 كوب سكر",
      "1 ملعقة صغيرة ملح",
      "نوري (أوراق الأعشاب البحرية)",
      "حشوات (سمك نيء، خضروات، أفوكادو، حسب الرغبة)",
    ],
    instructions:
      "1. اغسل الأرز جيداً حتى يصبح الماء صافي. \n2. في قدر، اخلط الأرز مع الماء، واتركه يغلي. خفف الحرارة، وغط القدر، واترك الأرز ينضج لمدة 15-20 دقيقة. \n3. في وعاء صغير، اخلط خل الأرز، السكر، والملح حتى يذوب السكر. \n4. بعد نضج الأرز، أضف خليط الخل إلى الأرز واخلط بلطف. \n5. ضع ورقة نوري على سطح عمل، ثم ضع طبقة من الأرز عليها، وأضف الحشوات. \n6. لف النوري بإحكام باستخدام حصيرة السوشي، ثم قطعه إلى شرائح.",
    
    category: "mainFood",
  },
  {
    id: 7,
    title: "تاكو",
    ingredients: [
      "8 قطع تورتيلا ذرة",
      "500 جرام لحم مفروم",
      "1 بصلة مفرومة",
      "2 فصوص ثوم مفروم",
      "1 ملعقة صغيرة كمون",
      "1 ملعقة صغيرة بابريكا",
      "1 ملعقة صغيرة ملح",
      "1/2 كوب صلصة تاكو",
      "خضروات (طماطم، خس، بصل، جبن مبشور)",
    ],
    instructions:
      "1. في مقلاة على نار متوسطة، سخن الزيت وأضف البصل والثوم، ثم قلّب حتى يصبح البصل شفافاً. \n2. أضف اللحم المفروم واطبخه حتى يتحمر. \n3. أضف الكمون، البابريكا، الملح، وصلصة التاكو. \n4. اطبخ المزيج حتى تتجانس النكهات. \n5. سخن التورتيلا في مقلاة ساخنة. \n6. ضع خليط اللحم في التورتيلا وأضف الخضروات والجبن حسب الرغبة.",
   
    category: "mainFood",
  },

  {
    id: 8,
    title: "روبيان",
    ingredients: [
      "500 جرام روبيان مقشر",
      "2 ملعقة كبيرة زيت زيتون",
      "4 فصوص ثوم مفروم",
      "1 ملعقة صغيرة فلفل أسود",
      "1 ملعقة صغيرة ملح",
      "عصير ليمونة واحدة",
      "1 ملعقة صغيرة بابريكا",
    ],
    instructions:
      "1. في مقلاة، سخن زيت الزيتون على نار متوسطة. \n2. أضف الثوم وقلّب لعدة ثوانٍ حتى يصبح لونه ذهبياً. \n3. أضف الروبيان، الفلفل الأسود، الملح، وعصير الليمون. \n4. اطبخ الروبيان حتى ينضج ويصبح وردياً (حوالي 3-4 دقائق لكل جانب). \n5. قدم الروبيان مع الليمون الإضافي.",
    
    category: "mainFood",
  },

];

app.use(cors());

app.get("/", (req, res) => {
  res.send("Welcome to server Recipes Food !!");
});

app.get('/api/recipes/:id', (req, res) => {
  const { id } = req.params;
  const recipe = recipes.find((recipe) => recipe.id === parseInt(id));
  if (recipe) {
    res.json(recipe);
  } else {
    res.status(404).send('Recipe not found');
  }
});


app.listen(port, () => {
  console.log(`Server running at http://localhost:${port}`);
});
